In [1]:
import pandas as pd
import toolbox_ML as tools_ML

In [2]:
#Creamos el DataFrame
df_titanic = pd.read_csv("./data/titanic.csv")
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [4]:
tools_ML.describe_df()

'X'

In [5]:
tools_ML.tipifica_variables(df=df_titanic, umbral_categoria=5, umbral_continua=50)

,nombre_variable,tipo_variable,cardinalidad,cardinalidad_porcentaje,tipo_sugerido
0,survived,int64,2,0.22,Binaria
1,pclass,int64,3,0.34,Categórica
2,sex,object,2,0.22,Binaria
3,age,float64,88,9.88,Numérica continua
4,sibsp,int64,7,0.79,Numérica discreta
5,parch,int64,7,0.79,Numérica discreta
6,fare,float64,248,27.83,Numérica continua
7,embarked,object,3,0.34,Categórica
8,class,object,3,0.34,Categórica
9,who,object,3,0.34,Categórica
10,adult_male,bool,2,0.22,Binaria
11,deck,object,7,0.79,Numérica discreta
12,embark_town,object,3,0.34,Categórica
13,alive,object,2,0.22,Binaria
14,alone,bool,2,0.22,Binaria